In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import os
import numpy as np
import seaborn as sns
sns.set_theme(style="darkgrid")
from functools import reduce
import requests
import json
from api_keys import g_key
with open('timeseries.json') as f:
  covid_cases = json.load(f)

In [2]:
mar01 = 'twitterapi/030120.csv'
mar05 = 'twitterapi/030520.csv'
mar10 = 'twitterapi/031020.csv'
mar15 = 'twitterapi/031520.csv'
mar20 = 'twitterapi/032020.csv'
mar25 = 'twitterapi/032520.csv'
apr01 = 'twitterapi/040120.csv'
apr05 = 'twitterapi/040520.csv'
apr10 = 'twitterapi/041020.csv'
apr15 = 'twitterapi/041520.csv'
apr20 = 'twitterapi/042020.csv'
apr25 = 'twitterapi/042520.csv'
may01 = 'twitterapi/050120.csv'
may05 = 'twitterapi/050520.csv'
may10 = 'twitterapi/051020.csv'
may15 = 'twitterapi/051520.csv'
may20 = 'twitterapi/052020.csv'
may25 = 'twitterapi/052520.csv'

In [3]:
twitter_mar_01 = pd.read_csv(mar01)
twitter_mar_05 = pd.read_csv(mar05)
twitter_mar_10 = pd.read_csv(mar10)
twitter_mar_15 = pd.read_csv(mar15)
twitter_mar_20 = pd.read_csv(mar20)
twitter_mar_25 = pd.read_csv(mar25)
twitter_apr_01 = pd.read_csv(apr01)
twitter_apr_05 = pd.read_csv(apr05)
twitter_apr_10 = pd.read_csv(apr10)
twitter_apr_15 = pd.read_csv(apr15)
twitter_apr_20 = pd.read_csv(apr20)
twitter_apr_25 = pd.read_csv(apr25)
twitter_may_01 = pd.read_csv(may01)
twitter_may_05 = pd.read_csv(may05)
twitter_may_10 = pd.read_csv(may10)
twitter_may_15 = pd.read_csv(may15)
twitter_may_20 = pd.read_csv(may20)
twitter_may_25 = pd.read_csv(may25)

/Users/jameswhite/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
march_frames = [twitter_mar_01, twitter_mar_05, twitter_mar_10, twitter_mar_15, twitter_mar_20, twitter_mar_25]

In [5]:
april_frames = [twitter_apr_01, twitter_apr_05, twitter_apr_10, twitter_apr_15, twitter_apr_20, twitter_apr_25]

In [6]:
may_frames = [twitter_may_01, twitter_may_05, twitter_may_10, twitter_may_15, twitter_may_20, twitter_may_25]

In [7]:
march_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), march_frames)

In [8]:
april_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), april_frames)

In [9]:
may_data = reduce(lambda  left,right: pd.merge(left,right,
                                            how='outer'), may_frames)

In [10]:
march_data = march_data[['id', 'created_at', 'place', 'retweet_count']]
# march_data['created_at'] = [x.split('12')[0] for x in march_data['created_at']]

In [11]:
march_data = march_data[march_data['place'].notna()]

In [12]:
march_data

,id,created_at,place,retweet_count
66,1234090090743451650,Sun Mar 01 12:16:20 +0000 2020,"Pennsylvania, USA",0
232,1234090114340487174,Sun Mar 01 12:16:26 +0000 2020,"Rovereto, Trentino-Alto Adige",0
485,1234090142169780225,Sun Mar 01 12:16:32 +0000 2020,"Hillsdale, NJ",0
605,1234090154408673283,Sun Mar 01 12:16:35 +0000 2020,"Annot, France",0
641,1234090163418148864,Sun Mar 01 12:16:37 +0000 2020,"Wandsworth, London",0
...,...,...,...,...
231855,1242797462441558017,Wed Mar 25 12:56:19 +0000 2020,"Dublin City, Ireland",0
231887,1242797462282293248,Wed Mar 25 12:56:19 +0000 2020,"Nairobi, Kenya",0
232046,1242797495408824322,Wed Mar 25 12:56:27 +0000 2020,"Kendall, FL",0
232070,1242797490694283269,Wed Mar 25 12:56:26 +0000 2020,"Ungaran, Indonesia",0
232118,1242797499791835143,Wed Mar 25 12:56:28 +0000 2020,"Bogotá, D.C., Colombia",0

In [13]:
march_data['place'].value_counts()

Manhattan, NY          27
New Delhi, India       20
Mumbai, India          17
Madrid, Spain          14
İstanbul, Türkiye      13
                       ..
Trivandrum, India       1
St Louis, MO            1
Silver Spring, MD       1
Melbourn, England       1
Safranbolu, Türkiye     1
Name: place, Length: 1327, dtype: int64

In [14]:
april_data = april_data[['id', 'created_at', 'place', 'retweet_count']]
# april_data['created_at'] = [x.split('12')[0] for x in april_data['created_at']]

In [15]:
april_data = april_data[april_data['place'].notna()]

In [16]:
april_data

,id,created_at,place,retweet_count
25,1245322458921676801,Wed Apr 01 12:09:45 +0000 2020,"Crediton, England",0
46,1245322458149933062,Wed Apr 01 12:09:45 +0000 2020,"West Midlands, England",0
155,1245322470808223745,Wed Apr 01 12:09:48 +0000 2020,"Tuusula, Suomi",1
305,1245322487421755392,Wed Apr 01 12:09:52 +0000 2020,"Nairobi, Kenya",0
362,1245322496162717696,Wed Apr 01 12:09:54 +0000 2020,"Vijayawada, India",0
...,...,...,...,...
222299,1254031217491673088,Sat Apr 25 12:55:15 +0000 2020,"Lekki, Nigeria",1
222378,1254031221140721664,Sat Apr 25 12:55:16 +0000 2020,"Camden Town, London",0
222469,1254031242565242880,Sat Apr 25 12:55:21 +0000 2020,"Guelph, Ontario",0
222773,1254031272558694405,Sat Apr 25 12:55:28 +0000 2020,"Tallinn, Estonia",1
222888,1254031280980717568,Sat Apr 25 12:55:30 +0000 2020,"Santa Ana, CA",0

In [17]:
april_data['place'].value_counts()

New Delhi, India       30
Mumbai, India          27
Manhattan, NY          17
Ikeja, Nigeria         17
Madrid, Spain          16
                       ..
Valencia, Spain         1
Bickington, England     1
Solomon Islands         1
Nigeria                 1
Isle of Man             1
Name: place, Length: 1536, dtype: int64

In [18]:
may_data = may_data[['id', 'created_at', 'place', 'retweet_count']]
# may_data['created_at'] = [x.split('12')[0] for x in may_data['created_at']]

In [19]:
may_data = may_data[may_data['place'].notna()]

In [20]:
may_data

,id,created_at,place,retweet_count
60,1256193425415852032,Fri May 01 12:07:06 +0000 2020,"Kensington, London",10
140,1256193436442476547,Fri May 01 12:07:08 +0000 2020,"Kantō, Chiba",0
433,1256193469384712192,Fri May 01 12:07:16 +0000 2020,"Lakeland Heights, TX",0
466,1256193465077108737,Fri May 01 12:07:15 +0000 2020,"Banbury, England",0
764,1256193503115313152,Fri May 01 12:07:24 +0000 2020,"Shimla, India",3
...,...,...,...,...
218015,1264903991617617923,Mon May 25 12:59:47 +0000 2020,"King's Lynn, England",0
218233,1264904010894413824,Mon May 25 12:59:51 +0000 2020,"Dindigul, India",0
218422,1264904037045956609,Mon May 25 12:59:57 +0000 2020,"Ilagan, Cagayan Valley",0
218497,1264904044205805569,Mon May 25 12:59:59 +0000 2020,Robinson Memorial Methodist Marathi Central Ch...,0
218523,1264904045250121854,Mon May 25 12:59:59 +0000 2020,"Rayachoti, India",0

In [21]:
march_data["Lat"] = ""
march_data["Lng"] = ""
march_data["Country"] = ""
april_data['Lat'] = ""
april_data['Lng'] = ""
april_data['Country'] = ""
may_data['Lat'] = ""
may_data['Lng'] = ""
may_data['Country'] = ""

In [ ]:
# create a params dict that will be updated with new city each iteration
params = {"key": g_key}

# Loop through the cities_pd and run a lat/long search for each city
for index, row in march_data.iterrows():
    base_url = "https://maps.googleapis.com/maps/api/geocode/json"

    address = row['place']
#     state = row['State']

    # update address key value
    params['address'] = f"{address}"

    # make request
    cities_lat_lng = requests.get(base_url, params=params)
        
    # convert to json
    cities_lat_lng = cities_lat_lng.json()
    try: 
        march_data.loc[index, "Lat"] = cities_lat_lng["results"][0]["geometry"]["location"]["lat"]
        march_data.loc[index, "Lng"] = cities_lat_lng["results"][0]["geometry"]["location"]["lng"]
    except:
        print('Lat/Lng not found')
    try:
        march_data.loc[index, 'Country'] = cities_lat_lng['results'][0]['address_components'][3]['short_name']
    except:
        pass
# Visualize to confirm lat lng appear
march_data.head()

Lat/Lng not found
Lat/Lng not found
Lat/Lng not found
Lat/Lng not found
Lat/Lng not found

In [ ]:
march_data.reset_index(drop=True)

In [ ]:
# Loop through the cities_pd and run a lat/long search for each city
for index, row in april_data.iterrows():
    base_url = "https://maps.googleapis.com/maps/api/geocode/json"

    address = row['place']
#     state = row['State']

    # update address key value
    params['address'] = f"{address}"

    # make request
    cities_lat_lng = requests.get(base_url, params=params)
        
    # convert to json
    cities_lat_lng = cities_lat_lng.json()
    try: 
        april_data.loc[index, "Lat"] = cities_lat_lng["results"][0]["geometry"]["location"]["lat"]
        april_data.loc[index, "Lng"] = cities_lat_lng["results"][0]["geometry"]["location"]["lng"]
    except:
        print('Lat/Lng not found')
    try:
        april_data.loc[index, 'Country'] = cities_lat_lng['results'][0]['address_components'][3]['short_name']
    except:
        pass
# Visualize to confirm lat lng appear
april_data.head()

In [ ]:
april_data.reset_index(drop=True)

In [ ]:
# Loop through the cities_pd and run a lat/long search for each city
for index, row in may_data.iterrows():
    base_url = "https://maps.googleapis.com/maps/api/geocode/json"

    address = row['place']
#     state = row['State']

    # update address key value
    params['address'] = f"{address}"

    # make request
    cities_lat_lng = requests.get(base_url, params=params)
        
    # convert to json
    cities_lat_lng = cities_lat_lng.json()
    try: 
        may_data.loc[index, "Lat"] = cities_lat_lng["results"][0]["geometry"]["location"]["lat"]
        may_data.loc[index, "Lng"] = cities_lat_lng["results"][0]["geometry"]["location"]["lng"]
    except:
        print('Lat/Lng not found')
    try:
        may_data.loc[index, 'Country'] = cities_lat_lng['results'][0]['address_components'][3]['short_name']
    except:
        pass
# Visualize to confirm lat lng appear
may_data.head()

In [ ]:
covid_cases['US'][0]['date']

In [ ]:
april_data